---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.FlexPipe.FlowState
source: html/5f2838c6-d4ed-24fc-a79e-134c1e62cfd3.htm
---
# Autodesk.Revit.DB.Plumbing.FlexPipe.FlowState Property

The flow state of the pipe.

## Syntax (C#)
```csharp
public PipeFlowState FlowState { get; }
```